Revit.Schedules.ScheduleExportOptions
View Schedule Export Options

Revit.Schedules.ScheduleExportOptions.InternalScheduleExportOptions
Internal reference to the Revit Element

Revit.Schedules.ScheduleExportOptions.#ctor(Autodesk.Revit.DB.ViewScheduleExportOptions)
Reference to the Element

Revit.Schedules.ScheduleExportOptions.ByProperties(System.String,System.String,System.Boolean,System.String,System.Boolean)
Creates View Schedule Export Options element.
columnHeaders: How to export column headers. Default is MultipleRows.
fieldDelimiter: How to delimit fields. Default is Tab.
headersFootersBlanks: Whether to export group headers, footers, and blank lines. Default is false.
textQualifier: How to qualify text fields. Default is DoubleQuote.
title: Whether or not to export the schedule title. Default is false.
View Schedule Export Options.